In [1]:
import pandas as pd

In [2]:
# Series
# .Series()

roll = pd.Series([5,7,9,12])
roll

0     5
1     7
2     9
3    12
dtype: int64

In [12]:
df = {
     'roll' : [7,1,2,3,4],
    'name' : ['Bibek','Ram','Raju','','',],
    'class' : ['AI','','','','',]
}

In [14]:
# dataframe

data = pd.DataFrame(df)
print(data)

   roll   name class
0     7  Bibek    AI
1     1    Ram
2     2   Raju
3     3
4     4

In [18]:
df = pd.read_csv('Sample_Data.csv')
print(df)

    Country  Age  Salary Purchased
0    France   44   72000        No
1     Spain   45   48000       Yes
2   Germany   30   54000        No
3       USA   20   35000        N0
4     Spain   38   61000        No
5   Germany   40   70000       Yes
6    France   35   58000       Yes
7       USA   45   60000       Yes
8     Spain   55   52000        No
9   Germany   32   50000       Yes
10    Spain   48   79000       Yes
11   France   48   79000       Yes
12  Germany   50   83000        No
13   France   37   67000       Yes
14   France   25   40000        No

In [19]:
df.shape

(15, 4)

# Functions/Attributes
    .head()
    .tail()
    .sample()
    .describe()

    .shape
    .dtypes

In [21]:
df.head()

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   45   48000       Yes
2  Germany   30   54000        No
3      USA   20   35000        N0
4    Spain   38   61000        No

In [25]:
df.tail(8)

    Country  Age  Salary Purchased
7       USA   45   60000       Yes
8     Spain   55   52000        No
9   Germany   32   50000       Yes
10    Spain   48   79000       Yes
11   France   48   79000       Yes
12  Germany   50   83000        No
13   France   37   67000       Yes
14   France   25   40000        No

In [23]:
df.sample()   #Random values dinxa

    Country  Age  Salary Purchased
12  Germany   50   83000        No

In [29]:
df.dtypes

Country      object
Age           int64
Salary        int64
Purchased    object
dtype: object

In [30]:
df.size

60

In [31]:
df.describe(),

(             Age        Salary
 count  15.000000     15.000000
 mean   39.466667  60533.333333
 std     9.789693  14426.496786
 min    20.000000  35000.000000
 25%    33.500000  51000.000000
 50%    40.000000  60000.000000
 75%    46.500000  71000.000000
 max    55.000000  83000.000000,)

In [33]:
df.head()

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   45   48000       Yes
2  Germany   30   54000        No
3      USA   20   35000        N0
4    Spain   38   61000        No

In [41]:
#Accesing a single column
df['Age']

0     44
1     45
2     30
3     20
4     38
5     40
6     35
7     45
8     55
9     32
10    48
11    48
12    50
13    37
14    25
Name: Age, dtype: int64

In [45]:
df.Country

0      France
1       Spain
2     Germany
3         USA
4       Spain
5     Germany
6      France
7         USA
8       Spain
9     Germany
10      Spain
11     France
12    Germany
13     France
14     France
Name: Country, dtype: object